<a href="https://colab.research.google.com/github/SurajKande/python-pandas/blob/master/pandas_dataframe_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [46]:
# to connect gdrive to colab for importing dataset
from google.colab import drive
drive.mount('/content/gdrive', force_remount = True)

Mounted at /content/gdrive

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [0]:
election_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/pennsylvania2012_turnout.csv', header=0, index_col='county')

In [49]:
election_data_frame.head()

          state   total      Obama  ...  voters    turnout     margin
county                              ...
Adams        PA   41973  35.482334  ...   61156  68.632677  27.629667
Allegheny    PA  614671  56.640219  ...  924351  66.497575  14.454399
Armstrong    PA   28322  30.696985  ...   42147  67.198140  37.204293
Beaver       PA   80015  46.032619  ...  115157  69.483401   6.605012
Bedford      PA   21444  22.057452  ...   32189  66.619031  54.929118

[5 rows x 8 columns]

In [50]:
election_data_frame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     67 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 4.7+ KB

In [51]:
election_data_frame.describe()

               total      Obama     Romney        voters    turnout     margin
count      67.000000  67.000000  67.000000  6.700000e+01  67.000000  67.000000
mean    83529.835821  40.777673  57.778871  1.269853e+05  64.228564  23.098439
std    125943.736544  10.887539  10.810693  1.930612e+05   5.197579  14.917905
min      1967.000000  21.096291  14.051451  3.232000e+03  52.569235   0.029069
25%     16386.500000  33.550316  52.544467  2.608200e+04  60.923223  12.849021
50%     33875.000000  39.360513  58.888277  5.497800e+04  64.971835  20.952971
75%     93597.000000  45.796105  65.117987  1.459025e+05  68.214879  33.425459
max    653598.000000  85.224251  77.748861  1.099197e+06  73.498766  71.172800

###Subsetting data frame

In [0]:
#subsetting the dataframe
election_result = election_data_frame[['winner', 'state', 'voters']]

In [0]:
p = election_data_frame.index

In [54]:
print(p)

Index(['Adams', 'Allegheny', 'Armstrong', 'Beaver', 'Bedford', 'Berks',
       'Blair', 'Bradford', 'Bucks', 'Butler', 'Cambria', 'Cameron', 'Carbon',
       'Centre', 'Chester', 'Clarion', 'Clearfield', 'Clinton', 'Columbia',
       'Crawford', 'Cumberland', 'Dauphin', 'Delaware', 'Elk', 'Erie',
       'Fayette', 'Forest', 'Franklin', 'Fulton', 'Greene', 'Huntingdon',
       'Indiana', 'Jefferson', 'Juniata', 'Lackawanna', 'Lancaster',
       'Lawrence', 'Lebanon', 'Lehigh', 'Luzerne', 'Lycoming', 'McKean',
       'Mercer', 'Mifflin', 'Monroe', 'Montgomery', 'Montour', 'Northampton',
       'Northumberland', 'Perry', 'Philadelphia', 'Pike', 'Potter',
       'Schuylkill', 'Snyder', 'Somerset', 'Sullivan', 'Susquehanna', 'Tioga',
       'Union', 'Venango', 'Warren', 'Washington', 'Wayne', 'Westmoreland',
       'Wyoming', 'York'],
      dtype='object', name='county')

In [55]:
election_result.head()

           winner state  voters
county
Adams      Romney    PA   61156
Allegheny   Obama    PA  924351
Armstrong  Romney    PA   42147
Beaver     Romney    PA  115157
Bedford    Romney    PA   32189

In [56]:
#subsetting the dataframe Alternative
rows = ['Philadelphia', 'Centre', 'Fulton']
col = ['winner', 'Obama', 'Romney']
PCL_counties = election_data_frame.loc[rows,col]
PCL_counties.head()

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

###Slicing rows and column of dataframe

In [0]:
# slicing rows using lables
counties_p = election_data_frame.loc['Perry':'Potter']

In [58]:
print(counties_p)

             state   total      Obama  ...   voters    turnout     margin
county                                 ...
Perry           PA   18240  29.769737  ...    27245  66.948064  38.821272
Philadelphia    PA  653598  85.224251  ...  1099197  59.461407  71.172800
Pike            PA   23164  43.904334  ...    41840  55.363289  10.978242
Potter          PA    7205  26.259542  ...    10913  66.022175  45.898681

[4 rows x 8 columns]

In [59]:
# slice rows in reverse order
counties_p_rev = election_data_frame.loc['Potter':'Perry':-1]
print(counties_p_rev)

             state   total      Obama  ...   voters    turnout     margin
county                                 ...
Potter          PA    7205  26.259542  ...    10913  66.022175  45.898681
Pike            PA   23164  43.904334  ...    41840  55.363289  10.978242
Philadelphia    PA  653598  85.224251  ...  1099197  59.461407  71.172800
Perry           PA   18240  29.769737  ...    27245  66.948064  38.821272

[4 rows x 8 columns]

In [60]:
# slicing columns 

# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election_data_frame.loc[:,:'Obama']

# Print the output of left_columns.head()
print(left_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452

In [61]:
# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election_data_frame.loc[:,'Obama' : 'winner']

# Print the output of middle_columns.head()
print(middle_columns.head())

               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney

In [62]:
# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election_data_frame.loc[:,'Romney':]

# Print the output of right_columns.head()
print(right_columns.head())

              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

###filtering

In [63]:
highturn_out = election_data_frame['turnout'] > 70
highturn_out_data_frame = election_data_frame[highturn_out]
highturn_out_data_frame.head()

         state   total      Obama  ...  voters    turnout     margin
county                             ...
Bucks       PA  319407  49.966970  ...  435606  73.324748   1.165284
Butler      PA   88924  31.920516  ...  122762  72.436096  34.896091
Chester     PA  248295  49.228539  ...  337822  73.498766   0.422079
Forest      PA    2308  38.734835  ...    3232  71.410891  21.100520
Franklin    PA   62802  30.110506  ...   87406  71.850903  38.473297

[5 rows x 8 columns]

In [64]:
#
too_close = election_data_frame['margin'] < 1

# Assign np.nan to the 'winner' column where the results were too close to call
election_data_frame.loc[too_close, 'winner'] = np.nan

# Print the output of election.info()
print(election_data_frame.info())            # we can observer 3 of the entries have cahnged to NaN for 'winner' column

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     64 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB
None

### using .map()

In [0]:
red_blue = {'Obama':'red','Romney':'blue'}
election_data_frame['result_color'] = election_data_frame['winner'].map(red_blue)

In [66]:
election_data_frame.head()

          state   total      Obama  ...    turnout     margin  result_color
county                              ...
Adams        PA   41973  35.482334  ...  68.632677  27.629667          blue
Allegheny    PA  614671  56.640219  ...  66.497575  14.454399           red
Armstrong    PA   28322  30.696985  ...  67.198140  37.204293          blue
Beaver       PA   80015  46.032619  ...  69.483401   6.605012          blue
Bedford      PA   21444  22.057452  ...  66.619031  54.929118          blue

[5 rows x 9 columns]

### Using vectorized functions:
using vectorized functions, we can loop over the data at the same speed as compiled code (C, Fortran, etc.)! NumPy, SciPy and pandas come with a variety of vectorized functions called Universal Functions

zscore : z-score is the number of standard deviations by which an observation is above the mean - so if it is negative, it means the observation is below the mean.

In [67]:
# Import zscore from scipy.stats
from scipy.stats import zscore

# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election_data_frame['turnout'])

# Print the type of turnout_zscore
print(type(turnout_zscore))

# Assign turnout_zscore to a new column: election['turnout_zscore']
election_data_frame['turnout_zscore'] = turnout_zscore

# Print the output of election.head()
print(election_data_frame.head())

<class 'numpy.ndarray'>
          state   total      Obama  ...     margin result_color  turnout_zscore
county                              ...
Adams        PA   41973  35.482334  ...  27.629667         blue        0.853734
Allegheny    PA  614671  56.640219  ...  14.454399          red        0.439846
Armstrong    PA   28322  30.696985  ...  37.204293         blue        0.575650
Beaver       PA   80015  46.032619  ...   6.605012         blue        1.018647
Bedford      PA   21444  22.057452  ...  54.929118         blue        0.463391

[5 rows x 10 columns]

### Indexing

In [0]:
# using new data set 
sales_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/sales/sales.csv', index_col='month')

In [69]:
sales_data_frame.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [81]:
# changing index from lower to upper 
upper_index = [indx.upper() for indx in sales_data_frame.index]

# Assign new_idx to sales.index
sales_data_frame.index = upper_index

# Print the sales DataFrame
sales_data_frame.head()

     eggs  salt  spam
JAN    47  12.0    17
FEB   110  50.0    31
MAR   221  89.0    72
APR    77  87.0    20
MAY   132   NaN    52

In [82]:
# Assign name to the indexs 
sales_data_frame.index.name = 'MONTHS'

# Print the sales DataFrame
sales_data_frame.head()

        eggs  salt  spam
MONTHS
JAN       47  12.0    17
FEB      110  50.0    31
MAR      221  89.0    72
APR       77  87.0    20
MAY      132   NaN    52

In [83]:
# give name to column names 
sales_data_frame.columns.name = 'PRODUCTS'

# Print the sales dataframe again
sales_data_frame.head()

PRODUCTS  eggs  salt  spam
MONTHS
JAN         47  12.0    17
FEB        110  50.0    31
MAR        221  89.0    72
APR         77  87.0    20
MAY        132   NaN    52

###multi level hirarchical index
as the name says it is used to have more than one index to collect data more accurately

*   input is the list of columns to use as index
```
SYNTAX:  dataframe.set_index([list of cols])
```

In [0]:
df = sales_data_frame

In [0]:
df.columns.name=None               #removing the columns index name for clarity

In [87]:
df

        eggs  salt  spam
MONTHS
JAN       47  12.0    17
FEB      110  50.0    31
MAR      221  89.0    72
APR       77  87.0    20
MAY      132   NaN    52
JUN      205  60.0    55

In [0]:
df.reset_index(inplace=True)

In [89]:
df

  MONTHS  eggs  salt  spam
0    JAN    47  12.0    17
1    FEB   110  50.0    31
2    MAR   221  89.0    72
3    APR    77  87.0    20
4    MAY   132   NaN    52
5    JUN   205  60.0    55

In [0]:
df.reset_index(inplace=True)    # just to create a extra index

In [91]:
df

   index MONTHS  eggs  salt  spam
0      0    JAN    47  12.0    17
1      1    FEB   110  50.0    31
2      2    MAR   221  89.0    72
3      3    APR    77  87.0    20
4      4    MAY   132   NaN    52
5      5    JUN   205  60.0    55

In [92]:
df.set_index(['MONTHS','index'])           # multi indexed with month and index

              eggs  salt  spam
MONTHS index
JAN    0        47  12.0    17
FEB    1       110  50.0    31
MAR    2       221  89.0    72
APR    3        77  87.0    20
MAY    4       132   NaN    52
JUN    5       205  60.0    55

###Pivoting DataFrames:
 pivot method lets us specify which columns to use as index and which to use as columns 


```
SYNTAX:  .pivot(index= , columns= , values= )
```

In [0]:
users_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/users.csv', header=0, index_col=0)

In [94]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [0]:
# Pivot the database to focus on visitors
visitors_data_frame = users_data_frame.pivot(index = 'weekday',columns ='city',values = 'visitors')

In [96]:
visitors_data_frame

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [0]:
# Pivot the database to focus on signups
signups_data_frame = users_data_frame.pivot(index='weekday', columns='city', values='signups')

In [98]:
signups_data_frame

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [0]:
# Pivot data base by both signups and visitors
pivoted_data_frame = users_data_frame.pivot(index='weekday', columns='city')

In [100]:
pivoted_data_frame

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

### stacking and unstacking:
 

*   unstacking = it means to remove the multi index , and used as column index

*   stacking = to convert the data frame into a multi level indexed data frame

In [101]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [0]:
#reindexing the data frame to a new data frame with multi index

In [0]:
users_multi_index_data_frame = users_data_frame.set_index(['city','weekday'])

In [105]:
users_multi_index_data_frame.sort_index()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [0]:
#to unstack 
weekday_unstacked = users_multi_index_data_frame.unstack(level='weekday')     # alt.  level=1 can also be used

In [109]:
weekday_unstacked

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [0]:
city_unstacked = users_multi_index_data_frame.unstack(level='city')

In [111]:
city_unstacked

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [0]:
#stack 
city_stacked = city_unstacked.stack('city')

In [113]:
city_stacked

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [0]:
# to swap the indexs
city_stacked = city_stacked.swaplevel(0,1)

In [122]:
city_stacked

                visitors  signups
city   weekday
Austin Mon           326        3
Dallas Mon           456        5
Austin Sun           139        7
Dallas Sun           237       12

In [124]:
city_stacked = city_stacked.sort_index()           # sorting the index of the data frame
city_stacked

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

### Melt dataframes:
melt is used to unpivot or to make column to rows and rows to columns

In [137]:
visitors_data_frame

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [139]:
 visitors_unindexed = visitors_data_frame.reset_index()
 visitors_unindexed

city weekday  Austin  Dallas
0        Mon     326     456
1        Sun     139     237

In [140]:
visitors_melt_data_frame = pd.melt(visitors_unindexed)
visitors_melt_data_frame

      city value
0  weekday   Mon
1  weekday   Sun
2   Austin   326
3   Austin   139
4   Dallas   456
5   Dallas   237

In [143]:
# we do not want the weekday to change 
visitors_melt_data_frame = pd.melt(visitors_unindexed, id_vars='weekday')
visitors_melt_data_frame

  weekday    city  value
0     Mon  Austin    326
1     Sun  Austin    139
2     Mon  Dallas    456
3     Sun  Dallas    237

In [145]:
# to give the column name instead of value
visitors_melt_data_frame = pd.melt(visitors_unindexed, id_vars='weekday', value_name='visitors')
visitors_melt_data_frame.sort_index()

  weekday    city  visitors
0     Mon  Austin       326
1     Sun  Austin       139
2     Mon  Dallas       456
3     Sun  Dallas       237

### pivot table

In [146]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [149]:
city_weekday = users_data_frame.pivot_table(index='city', columns='weekday')
city_weekday

        signups     visitors
weekday     Mon Sun      Mon  Sun
city
Austin        3   7      326  139
Dallas        5  12      456  237

In [151]:
city_weekday = users_data_frame.pivot_table(index='weekday', columns='city')
city_weekday.sort_index()

        signups        visitors
city     Austin Dallas   Austin Dallas
weekday
Mon           3      5      326    456
Sun           7     12      139    237

In [153]:
#example to better understand the pivot table
# to have a data frame to show the total number of visitors and signups
signups_visitors = users_data_frame.pivot_table(index='weekday',columns='city', aggfunc=sum, margins=True)
signups_visitors

        signups            visitors
city     Austin Dallas All   Austin Dallas   All
weekday
Mon           3      5   8      326    456   782
Sun           7     12  19      139    237   376
All          10     17  27      465    693  1158